<template>
    <div class="notlogin" v-if="!this.islogin">
        <h2 class="notice">Сначала необходимо войти в аккаунт!</h2>
    </div>
    <div class="text" v-else-if="this.part == 1">
        <form @submit.prevent="this.part += 1">
                <p><b>Какова ваша физическая активность:</b></p>
                <p><input name="activity" type="radio" value="1.2" v-model="this.act">Минимальный (сидячая работа, отсутствие физических нагрузок)</p>
                <p><input name="activity" type="radio" value="1.375" v-model="this.act">Низкий (тренировки не менее 20 мин 1-3 раза в неделю)</p>
                <p><input name="activity" type="radio" value="1.55" v-model="this.act">Умеренный (тренировки 30-60 мин 3-4 раза в неделю);</p>
                <p><input name="activity" type="radio" value="1.7" v-model="this.act">Высокий (тренировки 30-60 мин 5-7 раза в неделю; тяжелая физическая работа)</p>
                <p><input name="activity" type="radio" value="1.9" v-model="this.act">Экстремальный (несколько интенсивных тренировок в день 6-7 раз в неделю; очень трудоемкая работа)</p>
                <input type="submit" value="Отправить" class="submit">
        </form> 
    </div>
    <div class="text" v-else-if="this.part == 2">
        <form @submit.prevent="this.part += 1">
            <p><b>Сколько вам лет?</b></p>
            <input type="text" v-model="ages" required>
            <input type="submit" value="Отправить" class="submit">
        </form>
    </div>
    <div class="text" v-else-if="this.part == 3">
        <form @submit.prevent="this.part += 1">
            <p><b>Какой у вас вес?</b></p>
            <input type="text" v-model="this.weight" required>
            <input type="submit" value="Отправить" class="submit">
        </form>
    </div>
    <div class="text" v-else-if="this.part == 4">
        <form @submit.prevent="this.part += 1">
            <p><b>Какого вы роста?</b></p>
            <input type="text" v-model="this.height" required>
            <input type="submit" value="Отправить" class="submit">
        </form>
    </div>
    <div class="text" v-else-if="this.part == 5">
        <form @submit.prevent="this.part += 1">
            <p><b>Какова цель диеты?</b></p>
            <p><input type="radio" value="1" v-model="this.diet">Похудение</p>
            <p><input type="radio" value="2" v-model="this.diet">Поддержание веса</p>
            <p><input type="radio" value="3" v-model="this.diet">Набор веса</p>
            <input type="submit" value="Отправить" class="submit">
        </form>
    </div>
    <div class="text" v-else-if="this.part > 5 & this.part < 9">
        <h1 v-if="this.part == 6">Завтрак</h1>
        <h1 v-if="this.part == 7">Обед</h1>
        <h1 v-if="this.part == 8">Ужин</h1>
        <div class="food">
            <div class="products">
                <img src="../assets/por.jpg" alt="Каша">
                Каша
                <select v-model="this.porValue">
                    <Choice :product="this.por"/>
                </select>
                <ShowValue :value="this.porValue"/>
                Размер порции: <input type="number" v-model="qpor">
            </div>
            <div class="products" v-if="this.part == 7">
                <img src="../assets/soup.jpg" alt="Суп">
                Суп
                <select v-model="this.soup">
                    <Choice :product="this.soup"/>
                </select>
                <ShowValue :value="this.soupValue"/>
                Размер порции: <input type="number" v-model="qsoup">
            </div>
            <div class="products" v-if="this.part == 7">
                <img src="../assets/gar.jpg" alt="Гарнир">
                Гарнир
                <select v-model="this.gar">
                    <Choice :product="this.gar"/>
                </select>
                <ShowValue :value="this.garValue"/>
                Размер порции: <input type="number" v-model="qgar">
            </div>
            <div class="products">
                <img src="../assets/bre.jpg" alt="Хлеб">
                Хлебобулочные изделия
                <select v-model="this.breadValue">
                    <Choice :product="this.bread"/>
                </select>
                <ShowValue :value="this.breadValue"/>
                Размер порции: <input type="number" v-model="qbread">
            </div>
            <div class="products">
                <img src="../assets/egg.jpg" alt="Яйца">
                Яйца
                <select v-model="this.eggValue">
                    <Choice :product="this.egg"/>
                </select>
                <ShowValue :value="this.eggValue"/>
                Размер порции: <input type="number" v-model="qegg">
            </div>
            <div class="products">
                <img src="../assets/milk.jpg" alt="Кисломолчные продукты">
                Кисломолочные продукты
                <select v-model="this.milkValue">
                    <Choice :product="this.milk"/>
                </select>
                <ShowValue :value="this.milkValue"/>
                Размер порции: <input type="number" v-model="qmilk">
            </div>
            <div class="products" v-if="this.part == 7">
                <img src="../assets/meat.jpg" alt="Мясо">
                Мясо
                <select v-model="this.meatValue">
                    <Choice :product="this.meat"/>
                </select>
                <ShowValue :value="this.meatValue"/>
                Размер порции: <input type="number" v-model="qmeat">
            </div>
            <div class="products">
                <img src="../assets/veg.jpg" alt="Овощи">
                Овощи
                <select v-model="this.vegetablesValue">
                    <Choice :product="this.vegetables"/>
                </select>
                <ShowValue :value="this.vegetablesValue"/>
                Размер порции: <input type="number" v-model="qvegetables">
            </div>
            <div class="products">
                <img src="../assets/fru.jpg" alt="Фрукты">
                Фрукты
                <select v-model="this.fruitValue">
                    <Choice :product="this.fruit"/>
                </select>
                <ShowValue :value="this.fruitValue"/>
                Размер порции: <input type="number" v-model="qfruit">
            </div>
            <div class="products">
                <img src="../assets/dri.jpg" alt="Напиток">
                Напиток
                <select v-model="this.drinkValue">
                    <Choice :product="this.drink"/>
                </select>
                <ShowValue :value="this.drinkValue"/>
                Размер порции: <input type="number" v-model="qdrink">
            </div>
            <div class="products" v-if="this.part == 6 | this.part == 7">
                <img src="../assets/mushr.jpg" alt="Грибы">
                Грибы
                <select v-model="this.mushrValue">
                    <Choice :product="this.mushr"/>
                </select>
                <ShowValue :value="this.mushrValue"/>
                Размер порции: <input type="number" v-model="qmushr">
            </div>
            <div class="products">
                <img src="../assets/salad.jpg" alt="Салат">
                Салат
                <select v-model="this.saladValue">
                    <Choice :product="this.salad"/>
                </select>
                <ShowValue :value="this.saladValue"/>
                Размер порции: <input type="number" v-model="qsalad">
            </div>
        </div>
        <div class="result">
            Итого: {{ this.nutrients(1) }} г. белка, {{ this.nutrients(2) }} г. жиров, {{ this.nutrients(3) }} г. углеводов и {{ this.nutrients(4) }} Ккал
            <br>
            <div v-if="this.part == 6">
                Необходимо: {{ this.neednutrients(0.25, 1.5) }} г. белка, {{ this.neednutrients(2, 0.8) }} г. жиров, {{ this.neednutrients(3, 2) }} г. углеводов и {{ this.needcalories(0.25) }} Ккал
            </div>
            <div v-else-if="this.part == 7">
                Необходимо: {{ this.neednutrients(0.35, 1.5) }} г. белка, {{ this.neednutrients(2, 0.8) }} г. жиров, {{ this.neednutrients(3, 2) }} г. углеводов и {{ this.needcalories(0.35) }} Ккал
            </div>
            <div v-else>
                Необходимо: {{ this.neednutrients(0.15, 1.5) }} г. белка, {{ this.neednutrients(2, 0.8) }} г. жиров, {{ this.neednutrients(3, 2) }} г. углеводов и {{ this.needcalories(0.15) }} Ккал
            </div>
        </div>
        <input type="submit" value="Далее" class="submit" @click="next">
    </div>
    <div class="text" v-else>
        <h1>Итого</h1>
        <div class="total">
            <div class="requi">
                <h2>Завтрак</h2>
                <div v-for="el in this.result[0]" class="item">{{ el[0] }} - {{ el[1] }} г. <br><br></div>
            </div>
            <div class="requi">
                <h2>Обед</h2>
                <div v-for="el in this.result[1]" class="item">{{ el[0] }} - {{ el[1] }} г.<br><br></div>
            </div>
            <div class="requi">
                <h2>Ужин</h2>
                <div v-for="el in this.result[2]" class="item">{{ el[0] }} - {{ el[1] }} г. <br><br></div>
            </div>
        </div>
    </div>
</template>

<script>
import Choice from './Choice.vue'
import ShowValue from './ShowValue.vue'

export default {
    data() {
        return {
            islogin: false,
            caloriesRequired: localStorage.data,
            part: 6,
            act: 1.2,
            diet: 2,
            weight: 50,
            height: 150,
            ages: 15,
            result: [],
            por: [['Гречневая каша рассыпчатая', 3.6, 2.2, 17.1, 98.7], ['Каша "Янтарная"(из пшена я яблоками)', 3.8, 6.5, 17.5, 138.9], ['Каша боярская (из пшена с изюмом)', 4.8, 14.4, 19.5, 221.7], ['Каша вязкая из пшена с тыквой', 4.2, 8.0, 18.5, 158.0], ['Каша гурьевская', 4.4, 5.4, 22.6, 151.2], ['Каша из тыквы с манкой', 2.8, 8.4, 19.9, 161.5], ['Каша манная коричневая', 5.3, 6.0, 23.2, 162.1], ['Каша пшенная с сушеными сливами', 2.4, 2.9, 22.7, 121.3], ['Каша рисовая с какао', 4.1, 6.0, 20.3, 146.2], ['Манная каша на клюквенном соке', 1.9, 4.6, 17, 112.7], ['Манная каша с морковью', 2.7, 5.6, 9.7, 97.3], ['Мучная каша', 3.4, 4.9, 10.2, 95.3], ['Рисовая каша с черносливом', 1.9, 2.4, 26.4, 128.5], ['Рисовая с абрикосами по-венгерски', 2.6, 0.3, 28.5, 119.7], ['Яблочно-манная каша', 1.9, 4.3, 22, 128.4], ['Яичная каша (натуральная)', 10.3, 11.0, 10.8, 180.3], ['Яичная каша с овощами или грибами', 15.9, 13.2, 20.9, 261.0], ['Ячневая каша с картофелем', 1.8, 1.0, 8.7, 48.6]],
            meat: [['Свинина', 11.6, 49.1, 0.0, 484], ['Говядина', 18.7, 12.6, 0.0, 191], ['Баранина', 16.2, 15.3, 0.0, 201], ['Телятина', 19.9, 1.1, 0.0, 91], ['Кролик', 20.6, 12.8, 0.0, 197]],
            drink: [['Абрикосовый газированный коктейль', '36,4', '1', '0,8', '6,6'], ['Абрикосовый гоголь-моголь', '85,5', '3,1', '2,8', '12,9'], ['Абрикосовый десертный напиток', '86,1', '0,3', '0,04', '22,5'], ['Абрикосовый коктейль с поплавком', '70,8', '2,7', '2,7', '9,4'], ['Апельсиновое молоко', '78,2648', '3,0347', '2,5187', '10,6881'], ['Апельсиновый компот', '57,2', '0,3', '0,05', '14,9'], ['Бурятский чай', '94', '0,7', '9,3', '2,1'], ['Горячий абрикосовый напиток', '53,7', '2,3', '2,6', '5,6'], ['Какао с молоком', '102,8', '2,9', '2,9', '17,2'], ['Какао с молоком сгущенным', '86,6', '2,2', '2,4', '15'], ['Квас из ревеня', '34', '0,2', '0,04', '8,8'], ['Квас клюквенный', '40,4', '0,1', '0,03', '10,6'], ['Квас по-тобольски', '35,8', '0,6', '0,1', '8,6'], ['Квас хлебный из экстракта', '4,3', '0,04', '0,008', '1,1'], ['Квас яблочный', '36,7', '0,2', '0,09', '9,4'], ['Кефир с ревенем', '55', '2,1', '2,3', '6,8'], ['Кефир, ацидофилин, простокваша, ряженка', '55,9', '2,8', '3,2', '4,1'], ['Кисель апельсиновый', '97,8', '2,7', '2,1', '18'], ['Кисель брусничный', '75,2', '0,07', '0,05', '19,9'], ['Кисель из абрикосов', '53,7', '0,1', '0,01', '14,2'], ['Кисель из земляники', '51,1', '0,08', '0,04', '13,5'], ['Кисель из клюквы (густой)', '55,4', '0,05', '0,02', '14,7'], ['Кисель из концентрата на плодовых или ягодных экстрактах', '26,3', '0', '0', '7'], ['Кисель из овсяных хлопьев', '130,6', '4', '7,5', '12,6'], ['Кисель из плодов и ягод свежих', '55,2', '0,06', '0,02', '14,6'], ['Кисель из яблок (густой)', '62,1', '0,09', '0,08', '16,3'], ['Кисель молочный', '33,5', '0,9', '1', '5,5'], ['Кисель молочный (густой)', '60,5', '3', '3,3', '4,9'], ['Кисель морковный', '49,3', '0,3', '0,02', '12,8'], ['Коктейль "Юпитер"', '82,5', '2,5', '4,7', '8,1'], ['Коктейль молочный', '96,6', '2,9', '4,3', '12,5'], ['Коктейль с креветками', '57,5', '3,1', '4,5', '1,2'], ['Компот из абрикосов', '48,4', '0,2', '0,02', '12,7'], ['Компот из айвы', '72,4', '0,1', '0,1', '18,9'], ['Компот из барбариса', '111,7', '0', '0', '29,8'], ['Компот из вишни', '53,5', '0,3', '0,08', '13,7'], ['Компот из моркови', '34,1', '0,3', '0,02', '8,8'], ['Компот из плодов консервированных 2', '41,3', '0,3', '0,07', '10,5'], ['Компот из свежих плодов', '59,1', '0,1', '0,1', '15,3'], ['Компот из свеклы', '49,2', '1', '0,07', '11,8'], ['Компот из смеси сухофруктов', '55,6', '0,3', '0', '14,5'], ['Компот из тыквы и ревеня', '36,5', '0,3', '0,03', '9,4'], ['Компот из черники', '48,5', '0,4', '0,2', '12'], ['Компот из яблок и слив или из яблок и алычи', '66,6', '0,2', '0,1', '17,3'], ['Костяничный кисель', '37,5', '0,003', '0', '10'], ['Кофе на молоке', '64,1', '1,4', '1,5', '12,1'], ['Кофе на молоке по-варшавски', '72,5', '2', '3', '10,2'], ['Кофе на молоке сгущенном', '254,3', '2,3', '2,4', '59,5'], ['Кофе по-восточному', '61,7', '1,1', '1,2', '12,5'], ['Кофе черный 1-ый вариант (для кофеварки типа "Экспресс"', '202,6', '14', '14,5', '4,1'], ['Кофе черный 2-ой вариант', '10,7', '0,7', '0,8', '0,2'], ['Кофе черный с мороженым (глясе)', '111,7', '1,9', '4,1', '17,9'], ['Кофейный холодный напиток', '131,9', '1,9', '10,9', '7,1'], ['Креольский напиток', '0', '0', '0', '0'], ['Крыжовник с кефиром', '79,5', '3', '4,7', '6,6'], ['Лимонный кисель', '60,1', '0,06', '0,006', '16'], ['Медовуха "Зауральская"', '64,5', '1', '0,2', '15,6'], ['Молоко кипяченое', '60,5', '3', '3,3', '4,9'], ['Молочно-абрикосовый коктейль', '62', '2,7', '2,8', '7'], ['Молочный кисель из моркови', '60,8', '2', '1,9', '9,5'], ['Молочный напиток с абрикосами', '125', '1,8', '6,3', '16,2'], ['Морс брусничный', '41,4', '0,06', '0,04', '10,9'], ['Напиток "Лесная быль"', '67,6', '1,6', '1,4', '12,8'], ['Напиток "Петровский"', '14,9', '0,2', '0,02', '3,7'], ['Напиток "Фанта"', '27,6', '0,1', '0,01', '7,2'], ['Напиток апельсиновый', '43', '0,03', '0,006', '11,4'], ['Напиток апельсиновый или лимонный', '41,7', '0,08', '0,02', '11'], ['Напиток из айвы со сливками', '37,7', '0,2', '0,9', '7,8'], ['Напиток из айвы со сметаной', '32,7', '0,3', '2,3', '3'], ['Напиток из боярышника', '30', '0', '0', '8'], ['Напиток из боярышника с овсяным отваром', '42,4', '0,8', '0,5', '9,3'], ['Напиток из брусники', '79,6', '0,3', '0,2', '20,5'], ['Напиток из варенья', '19,4', '0', '0', '5,2'], ['Напиток из вишни с изюмом', '46,1', '0,7', '0,5', '10,4'], ['Напиток из кураги', '47,4', '0,4', '0,02', '12,1'], ['Напиток из сиропа', '0', '0', '0', '0'], ['Напиток из тыквы', '39,7', '0,2', '0,02', '10,3'], ['Напиток клюквенный', '40,3', '0,05', '0,02', '10,6'], ['Напиток Рябинушка', '41,1', '0,4', '0,05', '10,4'], ['Напиток яблочный', '42,1', '0,05', '0,05', '11,1'], ['Напиток яблочный с медом', '70,7', '0,3', '0,1', '18,3'], ['Настой барбарисовый', '178,7', '0', '0', '47,7'], ['Ногайский чай (карачаево-черкесский национальный напиток)', '105,4', '2,6', '9,2', '3,3'], ['Отвар из шиповника', '18,8', '0,3', '0,1', '4,4'], ['Пинемень куслят (кисель овсяный - мордовское национальное блюдо)', '54,9', '1,6', '0,8', '11,1'], ['Сбитень', '58,1', '0,2', '0,7', '13,5'], ['Сбитень по Новониколаевски', '68,7', '0,1', '0,009', '18,2'], ['Студенческий напиток', '13,9', '1,2', '0,03', '2,3'], ['Тыквенный кисель', '101,5', '1,9', '5', '13'], ['Хлебный квас', '27', '0,2', '0', '5,2'], ['Чай брусничный', '26,4', '0,02', '0,02', '7'], ['Чай из душицы', '27,1', '0,01', '0', '7,2'], ['Чай рябиновый', '9,2', '0,3', '0,05', '2'], ['Чай с лимоном', '41,1', '0,2', '0,05', '10,6'], ['Чай с молоком или сливками', '52,9', '0,9', '0,8', '11,3'], ['Чай с сахаром, вареньем, джемом, медом, повидлом', '41,7', '0,2', '0,05', '10,8'], ['Чай с яблоками', '17,2', '0,3', '0,2', '3,7'], ['Чай фруктовый с абрикосами', '169,8', '4,7', '0,4', '39,4'], ['Черника с молоком', '60', '2,2', '2,3', '8,2'], ['Яблочный пунш', '75', '0,3', '0,3', '19,1'], ['Ягодная наливка', '124,1', '0,6', '0,4', '31,6']],
            bread: [['Хлеб пшеничный', 7.4, 2.2, 53.0, 246], ['Хлеб ржаной', 4.7, 0.6, 49.5, 210], ['Сухари пшеничные', 11.6, 1.8, 72.1, 327], ['Лаваш армянский', 7.7, 1.1, 47.8, 239], ['Батон нарезной', 9.4, 2.7, 50.7, 261], ['Баранки', 16.4, 1.1, 69.7, 342], ['Сушки', 11.1, 1.0, 72.2, 335], ['Булочка', 7.4, 1.8, 43.7, 218]],
            egg: [['Куриное яйцо', 12.7, 11.1, 0.6, 153], ['Перепелиное яйцо', 11.9, 13.3, 0.8, 170], ['Утиное яйцо', 13.5, 14.1, 0.2, 176], ['Омлет', 9.7, 15.5, 1.7, 1.7]],
            milk: [["KRAFT BREAKSTONE'S FREE Обезжиренная сметана", 91.0, 4.7, 1.3, 15.1], ["KRAFT BREYERS LIGHT N' LIVELY Клубничний йогурт 1% с низким содержанием жира", 108.0, 3.2, 0.8, 21.9], ['KRAFT BREYERS LIGHT Обезжиренный клубничный йогурт (с заменителями сахара аспартам и фруктозой)', 55.0, 3.4, 0.2, 9.9], ['KRAFT BREYERS Smooth Creamy Клубничний йогурт 1% с низким содержанием жира', 102.0, 3.8, 0.9, 19.9], ['KRAFT BREYERS Клубничний йогурт 1% с низким содержанием жира', 96.0, 3.8, 0.8, 18.2], ['KRAFT CHEEZ WHIZ LIGHT, Пастеризованый плавленый сыр', 215.0, 16.3, 9.5, 16.2], ['KRAFT CHEEZ WHIZ, Пастеризованый плавленый сырный соус', 276.0, 12.0, 21.0, 9.2], ['KRAFT FREE, Обезжиренный пастеризованый плавленый сыр', 148.0, 22.7, 1.0, 11.7], ['KRAFT VELVEETA LIGHT Пастеризованый плавленый сыр с низким модержанием жира', 222.0, 19.6, 10.6, 11.8], ['Ацидофилин 1%', 40.0, 3.0, 1.0, 4], ['Ацидофилин 3,2% жирности', 59.0, 2.9, 3.2, 3.8], ['Ацидофилин 3,2% жирности сладкий', 77.0, 2.8, 3.2, 8.6], ['Ацидофилин обезжиренный', 31.0, 3.0, 0.05, 3.9], ['Белковая добавка, на основе молока, Muscle Milk Light, порошок', 396.0, 50.0, 12.0, 20], ['Белковая добавка, на основе молока, Muscle Milk, порошок', 411.0, 45.71, 17.14, 11.4], ['Брынза из коровьего молока, м.д.ж. 40% в сух. в-ве', 262.0, 22.1, 19.2, 0.4], ['Брынза овечья, м.д.ж. 40% в сух. в-ве', 260.0, 21.1, 18.8, 0.3], ['Варенец 2,5% жирности', 53.0, 2.9, 2.5, 4.1], ['Дульсе де лече, варёное сгущенное молоко (латиноамериканский десерт)', 315.0, 6.84, 7.35, 55.35], ['Заменитель взбитых сливок, приготовленный из порошка, 6% жирности', 100.0, 0.9, 6.0, 10.6], ['Заменитель молока с маслами лауриновой кислоты', 61.0, 1.75, 3.41, 6.16], ['Заменитель молока, без сои', 46.0, 1.6, 2.0, 5.3], ['Заменитель молока, порошок', 529.0, 2.48, 32.92, 59.29], ['Заменитель сливок 10% жирности с гидрогенизированным растительным маслом и протеинами сои', 136.0, 1.0, 9.97, 11.38], ['Заменитель сливок 10% жирности с маслами лауриновой кислоты и казеинатом натрия', 136.0, 1.0, 9.97, 11.38], ['Заменитель сливок 13,5% жирности ароматизированный', 251.0, 0.69, 13.5, 33.97], ['Заменитель сливок 3,5% жирности', 71.0, 0.8, 3.5, 9.1], ['Заменитель сливок сухой 15,7% жироности', 431.0, 1.9, 15.7, 73.4], ['Заменитель сливок сухой 21,5% жироности ароматизированный', 482.0, 0.68, 21.47, 74.22], ['Заменитель сливочного масла, обезжиренный, порошок', 373.0, 2.0, 1.0, 89], ['Заменитель сметаны 19,5% жирности', 208.0, 2.4, 19.52, 6.63], ['Заменитель сыра (иммитация), американский или чеддер, с низким содержанием холестерина', 390.0, 25.0, 32.0, 1], ['Заменитель сыра (иммитация), американский чеддер', 239.0, 16.7, 14.0, 11.6], ['Заменитель сыра, моцарелла', 248.0, 11.47, 12.22, 23.67], ['Заправка для десерта, в аэрозольной упаковке', 264.0, 0.98, 22.3, 16.07], ['Заправка для десерта, полужидкая, замороженная', 318.0, 1.25, 25.31, 23.05], ['Заправка для десерта, порошок', 577.0, 4.9, 39.92, 52.54], ['Заправка для десерта, порошок, 1,5 унции приготовлены на пол стакана молока', 194.0, 3.61, 12.72, 17.13], ['Йогурт 1,15% жирности, 4% белка, фруктовый', 99.0, 3.98, 1.15, 18.64], ['Йогурт 1,15% жирности, 4% белка, фруктовый, с витамином D', 99.0, 3.98, 1.15, 18.64], ['Йогурт 1,25% жирности, 5% белка, ванильный', 85.0, 4.93, 1.25, 13.8], ['Йогурт 1,25% жирности, 5% белка, с витамином D, ванильный', 85.0, 4.93, 1.25, 13.8], ['Йогурт 1,25% жирности, ванильный, с низкокалорийным подсластителем', 86.0, 4.93, 1.25, 13.8], ['Йогурт 1,4% жирности, 4,9% белка, фруктовый', 105.0, 4.86, 1.41, 18.6], ['Йогурт 1,4% жирности, фруктовый, с низкокалорийным подсластителем', 105.0, 4.86, 1.41, 18.6], ['Йогурт 1,4% жирности, фруктовый, с низкокалорийным подсластителем, с витамином D', 105.0, 4.86, 1.41, 18.6], ['Йогурт 1,5% жирности, 4,1% белка, натуральный', 57.0, 4.1, 1.5, 5.9], ['Йогурт 1,5% жирности, 4% белка, плодово-ягодный', 90.0, 4.0, 1.5, 14.3], ['Йогурт 1,5% жирности, 5,25% белка, натуральный', 63.0, 5.25, 1.55, 7.04], ['Йогурт 1,5% жирности, 5% белка, сладкий', 70.0, 5.0, 1.5, 8.5], ['Йогурт 1% жирности, 4,4% белка, фруктовый', 102.0, 4.37, 1.08, 19.05], ['Йогурт 1% жирности, 4,4% белка, фруктовый, с витамином D', 102.0, 4.37, 1.08, 19.05], ['Йогурт 3,2% жирности, 5% белка, натуральный', 68.0, 5.0, 3.2, 3.5], ['Йогурт 3,2% жирности, 5% белка, сладкий', 87.0, 5.0, 3.2, 8.5], ['Йогурт 3,25% жирности, 3,5% белка, натуральный', 61.0, 3.47, 3.25, 4.66], ['Йогурт 6% жирности, 5% белка, натуральный', 92.0, 5.0, 6.0, 3.5], ['Йогурт 6% жирности, 5% белка, сладкий', 112.0, 5.0, 6.0, 8.5], ['Йогурт греческий 1,5% жирности, лимонный, CHOBANI', 92.0, 7.75, 1.47, 11.41], ['Йогурт греческий 1,7% жирности, клубнично-банановый, CHOBANI', 88.0, 8.0, 1.71, 9.54], ['Йогурт греческий 1,7% жирности, кокосовый, CHOBANI', 92.0, 8.11, 1.71, 10.54], ['Йогурт греческий 1,8% жирности, ананасовый, CHOBANI', 94.0, 7.05, 1.82, 11.57], ['Йогурт греческий 1,8% жирности, ягодный, CHOBANI', 93.0, 8.26, 1.83, 10.34], ['Йогурт греческий 1,9% жирности, натуральный', 73.0, 9.95, 1.92, 3.94], ['Йогурт греческий 1.7% жирности, абрикосовый, CHOBANI', 93.0, 7.22, 1.71, 11.55], ['Йогурт греческий 2,5% жирности, ванильный', 95.0, 8.64, 2.5, 9.54], ['Йогурт греческий 2,6% жирности , клубничный', 105.0, 8.17, 2.57, 11.29], ['Йогурт греческий 2,9% жирности, клубничный, DANNON OIKOS', 106.0, 8.25, 2.92, 10.67], ['Йогурт греческий 3% жирности, фруктовый', 106.0, 7.33, 3.0, 12.29], ['Йогурт греческий 4% жирности, натуральный, CHOBANI', 82.0, 8.24, 4.01, 2.44], ['Йогурт греческий 5% жирности, натуральный', 97.0, 9.0, 5.0, 3.98], ['Йогурт греческий обезжиренный клубничный', 82.0, 8.05, 0.15, 11.47], ['Йогурт греческий обезжиренный малиновый', 78.0, 8.64, 0.18, 9.87], ['Йогурт греческий обезжиренный натуральный', 59.0, 10.19, 0.39, 3.6], ['Йогурт греческий обезжиренный, ванильный, CHOBANI', 71.0, 9.07, 0.22, 7.79], ['Йогурт греческий обезжиренный, ванильный, DANNON OIKOS', 85.0, 8.12, 0.14, 12.22], ['Йогурт греческий обезжиренный, клубничный, DANNON OIKOS', 84.0, 8.03, 0.22, 12.13], ['Йогурт греческий обезжиренный, лимонный, CHOBANI', 78.0, 8.62, 0.15, 10.16], ['Йогурт греческий обезжиренный, малиновый, CHOBANI', 81.0, 7.65, 0.22, 11.48], ['Йогурт греческий обезжиренный, натуральный, CHOBANI', 54.0, 9.53, 0.24, 3.23], ['Йогурт греческий обезжиренный, персиковый, CHOBANI', 80.0, 7.76, 0.11, 11.2], ['Йогурт греческий обезжиренный, с гранатом, CHOBANI', 80.0, 7.45, 0.18, 11.33], ['Йогурт греческий обезжиренный, с ежевикой, CHOBANI', 95.0, 7.54, 0.37, 15.03], ['Йогурт греческий обезжиренный, с клубникой, CHOBANI', 79.0, 7.28, 0.23, 11.46], ['Йогурт греческий обезжиренный, черничный, CHOBANI', 82.0, 7.23, 0.24, 12.28], ['Йогурт замороженный, 2,5% жирности (вкусы кроме шоколадного)', 139.0, 8.0, 2.5, 21], ['Йогурт замороженный, обезжиренный, с низкокалорийным подсластителем (вкусы кроме шоколадного)', 104.0, 4.4, 0.8, 17.7], ['Йогурт обезжиренный, 5,7% белка, натуральный', 56.0, 5.73, 0.18, 7.68], ['Йогурт обезжиренный, ванильный', 78.0, 2.94, 0.0, 17.04], ['Йогурт обезжиренный, ванильный или лимонный , с низкокалорийным подсластителем, с витамином D', 43.0, 3.86, 0.18, 7.5], ['Йогурт обезжиренный, ванильный или лимонный, с низкокалорийным подсластителем', 43.0, 3.86, 0.18, 7.5], ['Йогурт обезжиренный, фруктовый', 95.0, 4.4, 0.2, 19], ['Йогурт обезжиренный, фруктовый, с витамином D', 95.0, 4.4, 0.2, 19], ['Йогурт обезжиренный, шоколадный', 112.0, 3.53, 0.0, 22.33], ['Йогурт обезжиренный, шоколадный, с витамином D', 112.0, 3.53, 0.0, 22.33], ['Йогурт питьевой 2,5% жирности, с фруктовым наполнителем', 86.0, 2.8, 2.5, 13], ['Йогурт питьевой 1,5% жирности, с фруктовым наполнителем', 78.0, 3.0, 1.5, 13], ['Йогурт питьевой 1% жирности, с фруктовым наполнителем', 71.0, 2.7, 1.0, 12.2], ['Йогурт питьевой клубничный 0,9% жирности, витаминизированный, LIFEWAY', 62.0, 3.39, 0.9, 10.2], ['Йогурт сублимационной сушки', 534.0, 16.0, 36.0, 38.1], ['Йогурт сублимационной сушки, плодово-ягодный', 486.0, 16.0, 26.0, 48.5], ['Йогурт сублимационной сушки, сладкий', 493.0, 16.0, 27.5, 47.3], ['Какао с молоком, напиток', 77.0, 3.52, 2.34, 9.74], ['Какао со сгущенным молоком и сахаром, консервы', 321.0, 8.2, 7.5, 51.6], ['Какао со сгущенными сливками, консервы', 356.0, 8.2, 15.5, 48.3], ['Кефир 1% жирности', 40.0, 3.0, 1.0, 4], ['Кефир 1% жирности, витаминизированный, LIFEWAY', 43.0, 3.79, 1.02, 4.77], ['Кефир 2,5% жирности', 53.0, 2.9, 2.5, 4], ['Кефир 3,2% жирности', 59.0, 2.9, 3.2, 4], ['Кефир обезжиренный', 31.0, 3.0, 0.05, 4]],
            fruit: [['Бананы', 1.7, 0.0, 22.1, 87], ['Апельсины', 0.8, 0.0, 8.6, 38], ['Яблоки', 0.5, 0.0, 11.4, 48], ['Груша', 0.5, 0.0, 10.6, 41], ['Персики', 0.9, 0.0, 10.1, 42], ['Абрикосы', 0.7, 0.0, 10.1, 44], ['Ананас', 0.3, 0.0, 11.9, 49], ['Киви', 1.0, 0.7, 9.7, 46], ['Лимон', 0.9, 0.0, 3.3, 30], ['Хурма', 0.7, 0.0, 15.7, 61], ['Мандарин', 0.9, 0.0, 8.8, 8.8]],
            vegetables: [['Огурцы', 0.7, 0.0, 3.1, 15], ['Томаты', 0.7, 0.0, 4.1, 19], ['Картофель вареный', 2.0, 0.3, 16.5, 80], ['Картофель молодой', 2.2, 0.3, 12.5, 57], ['Морковь', 1.3, 0.1, 6.3, 29], ['Лук репчатый', 1.6, 0.0, 9.3, 41], ['Редис', 1.5, 0.0, 4.2, 22], ['Кабачки', 0.8, 0.3, 5.9, 30], ['Баклажаны', 0.6, 0.1, 7.5, 22], ['Свекла', 1.7, 0.0, 10.5, 46], ['Капуста белокочанная', 1.9, 0.0, 5.7, 31], ['Фасоль', 4.4, 0.0, 4.4, 36], ['Редька', 1.7, 0.0, 7.1, 33], ['Перец сладкий', 1.2, 0.0, 5.0, 5]],
            soup: [['Борщ', 3.8, 2.9, 4.3, 57.7], ['Борщ из свежей капусты и картофеля по 1-110', 1.0, 1.1, 5.4, 36], ['Борщ кубанский с кабачками', 4.9, 5.7, 4.7, 88.2], ['Борщ летний (с ботвой свеклы)', 3.9, 3.2, 6.6, 69], ['Борщ летний по 1-122', 1.1, 1.2, 5.7, 38], ['Борщ московский', 8.3, 7.2, 4.6, 115.5], ['Борщ по 1-110', 0.8, 1.0, 4.1, 29], ['Борщ по-вегетариански', 0.5, 2.7, 2.2, 34.7], ['Борщ с капустой и картофелем', 3.8, 2.9, 5.4, 61.6], ['Борщ с картофелем по 1-112', 1.1, 1.1, 6.8, 42], ['Борщ с черносливом и грибами', 4.6, 3.1, 7.4, 74], ['Борщ сибирский', 5.4, 3.4, 6.5, 76.7], ['Борщ украинский', 4.4, 4.4, 8.7, 90.2], ['Борщ украинский по 1-122', 1.1, 2.2, 6.5, 50], ['Борщ холодный', 1.1, 1.3, 3.0, 27.1], ['Борщ холодный', 1.5, 3.2, 3.0, 45.7], ['Говяжий суп', 2.3, 1.1, 2.6, 28.8], ['Голландский зеленый суп', 4.8, 1.4, 8.8, 65.3], ['Голландский зеленый суп', 0.0, 0.0, 0.0, 0], ['Гороховый суп', 2.2, 3.0, 5.0, 54.3], ['Грибной борщ', 0.7, 2.1, 1.4, 27.1], ['Грибной суп', 0.8, 3.4, 4.6, 50.9], ['Куриный суп по-индийски', 0.0, 0.0, 0.0, 0], ['Куриный суп с макаронами', 4.5, 3.3, 3.1, 59.7], ['Литовский холодный борщ', 2.9, 2.2, 8.6, 63.8], ['Лэпсытепх (бульон с жареными орешками из муки и зажаркой - адыгейское национальное блюдо)', 11.4, 10.3, 7.6, 167.1], ['Молочный суп с морковью', 1.6, 1.5, 3.7, 33.6], ['Окрошка мясная на кефире с говядиной, по 1-194', 2.8, 1.1, 4.3, 39], ['Окрошка мясная со сметаной и говядиной, по 1-192', 2.1, 1.7, 6.3, 52], ['Окрошка овощная по 1-192', 0.9, 0.8, 6.8, 39], ['Похлебка грибная (карельское национальное блюдо)', 3.1, 4.1, 8.5, 81.6], ['Похлебка из сардин в горшочке', 6.4, 6.9, 7.5, 115.8], ['Похлебка по-суворовски', 8.7, 2.4, 3.8, 70.4], ['Похлебка рыбная по-сибирски', 4.8, 1.5, 6.7, 57.8], ['Похлебка старомосковская', 3.6, 7.1, 4.2, 94.1], ['Рассольник', 0.9, 1.6, 5.9, 40.4], ['Рассольник', 0.0, 0.0, 0.0, 0], ['Рассольник домашний', 0.9, 1.6, 5.4, 38.4], ['Рассольник домашний по 1-136', 1.0, 1.0, 5.8, 36], ['Рассольник ленинградский', 1.3, 1.7, 8.8, 53.3], ['Рассольник по-кубански', 4.9, 5.7, 7.9, 100.8], ['Рисовый грибной суп', 2.0, 2.2, 9.3, 62.7], ['Свекольник холодный', 1.8, 3.6, 6.2, 62.6], ['Свекольник холодный по 1-198', 0.8, 0.2, 6.1, 30], ['Сладкий суп из черники с клецками', 1.4, 1.3, 15.6, 75.8], ['Солянка грибная по 1-172', 0.5, 1.2, 1.3, 18], ['Солянка рыбная, по 1-170', 2.4, 1.2, 1.2, 25], ['Солянка сборная мясная, по 1-168', 2.1, 2.8, 1.3, 39], ['Суп "Ереванский"', 3.1, 1.9, 6.5, 54.1], ['Суп "Хинкал" (суп с мясом и ракушками - дагестанское национальное блюдо)', 10.2, 6.1, 7.8, 125.1], ['Суп вишневый с клецками', 2.0, 1.1, 16.4, 79.3], ['Суп гороховый с яблоками', 2.5, 2.3, 3.6, 44], ['Суп грибной картофельный', 0.8, 3.7, 2.6, 45.5], ['Суп грибной с пирожками', 1.3, 5.2, 2.2, 60.3], ['Суп из белых грибов с макаронами', 1.4, 4.7, 2.8, 58.1], ['Суп из говядины', 2.4, 2.5, 2.6, 41.9], ['Суп из клюквы и яблок', 0.4, 1.9, 8.7, 51], ['Суп из моркови и кефира', 2.3, 2.1, 8.0, 58], ['Суп из овощей', 1.7, 1.6, 4.2, 36.7], ['Суп из овсяной крупы с яблоками', 1.7, 1.4, 11.5, 62.4], ['Суп из овсяных хлопьев с яблоками', 1.7, 1.5, 7.4, 48.1], ['Суп из плодов свежих', 0.2, 0.2, 16.2, 63.2], ['Суп из свежих помидоров', 0.9, 2.1, 4.0, 37.4], ['Суп из свежих фруктов по 1-200', 0.1, 0.1, 11.9, 50], ['Суп из свекольной ботвы и щавеля', 1.7, 3.8, 1.6, 46.6], ['Суп из смеси сухофруктов', 0.5, 0.0, 20.9, 80.5], ['Суп из спаржи', 2.6, 4.8, 6.6, 78], ['Суп из утки', 10.9, 23.0, 8.6, 283], ['Суп из фасоли с орехами', 2.3, 4.8, 3.8, 67], ['Суп из цветной капусты', 1.0, 3.2, 1.1, 36.8], ['Суп из черники с клецками', 4.6, 2.3, 17.6, 105.4], ['Суп из черники с макаронами', 0.5, 0.8, 6.6, 34.2], ['Суп из чечевицы', 2.5, 4.2, 5.2, 67.8], ['Суп картофельный', 1.3, 1.1, 9.4, 50.6], ['Суп картофельный по 1-142', 1.1, 1.2, 7.8, 45], ['Суп картофельный с бобовыми', 2.7, 2.4, 10.8, 73.3], ['Суп картофельный с грибами', 1.7, 1.2, 6.5, 42.2], ['Суп картофельный с кальмарами', 4.0, 2.4, 6.5, 62.4], ['Суп картофельный с крупой', 1.3, 1.2, 10.0, 53.6], ['Суп картофельный с макаронными изделиями', 1.3, 1.0, 8.8, 47.7], ['Суп картофельный с мясными фрикадельками', 3.3, 2.2, 6.5, 57.6], ['Суп картофельный с перловой крупой по 1-146', 1.0, 1.1, 6.5, 37], ['Суп картофельный с рыбными фрикадельками', 2.5, 1.6, 6.6, 48.9], ['Суп картофельный со сладким перцем', 0.9, 3.7, 4.9, 55.9], ['Суп лапша грибная', 1.6, 2.1, 4.1, 41.3], ['Суп молочный рисовый', 3.1, 5.0, 11.1, 99.2], ['Суп молочный с белокочанной капустой, по 1-180', 2.0, 2.0, 6.8, 54], ['Суп молочный с грибами', 2.5, 3.3, 7.3, 67.2], ['Суп молочный с картофельными "стружками"', 1.4, 3.6, 3.5, 51.3], ['Суп молочный с клецками', 3.8, 5.2, 13.0, 110.9], ['Суп молочный с крупой', 2.6, 2.8, 8.7, 68.2], ['Суп молочный с макаронами, по 1-172', 2.2, 1.9, 7.9, 58], ['Суп молочный с макаронными изделиями', 2.8, 2.7, 7.7, 64.6], ['Суп молочный с овощами', 4.5, 2.8, 11.2, 84.9], ['Суп молочный с рисом', 2.2, 2.8, 7.5, 61.9], ['Суп молочный с рисом', 2.1, 3.9, 10.0, 81], ['Суп молочный с рисом, по 1-174', 1.8, 1.9, 7.3, 54], ['Суп молочный с тыквой', 2.1, 1.7, 7.2, 50.9], ['Суп молочный с тыквой и манной крупой, по 1-178', 2.0, 2.2, 5.4, 50], ['Суп овощной на отваре шиповника', 2.3, 3.2, 7.9, 67.8], ['Суп перловый с грибами по 1-164', 1.6, 1.2, 6.4, 43], ['Суп пикантный с креветками', 9.0, 2.7, 5.7, 81.9], ['Суп полевой', 1.5, 5.9, 9.2, 93.5], ['Суп пшенный с мясом по 1-160', 2.9, 2.2, 6.4, 57], ['Суп рисовый по 1-158', 0.9, 1.1, 6.2, 38], ['Суп с бобовыми (фасоль) по 1-162', 3.0, 1.3, 6.9, 54], ['Суп с крупой', 0.7, 1.9, 5.7, 41.5], ['Суп с макаронными изделиями', 0.9, 2.0, 4.5, 39], ['Суп с перловой крупой', 0.0, 0.0, 0.0, 0], ['Суп с рыбными вареничками', 5.2, 2.6, 5.3, 64.3], ['Суп с рыбными фрикадельками', 3.7, 0.6, 2.3, 28.8], ['Суп с фрикадельками', 1.7, 0.9, 2.3, 24], ['Суп со шпинатом и грибами', 1.8, 7.6, 0.5, 76.8], ['Суп фасолевый', 1.7, 4.8, 4.2, 66.3], ['Суп харчо с мясом по 1-164', 3.1, 4.5, 5.5, 75], ['Суп холодный "Таратор"', 3.9, 10.0, 10.7, 146.1], ['Суп-крем из тыквы', 3.4, 4.6, 10.0, 92.5], ['Суп-лапша домашняя', 1.2, 2.4, 5.9, 47.8], ['Суп-лапша с помидорами по-казачьи', 4.0, 4.1, 4.0, 67.4], ['Суп-пюре из зеленого горошка', 4.0, 3.0, 10.5, 82.7], ['Суп-пюре из кабачков или тыквы', 1.3, 2.8, 4.5, 47], ['Суп-пюре из картофеля и моркови', 0.6, 2.9, 2.4, 37.7], ['Суп-пюре из картофеля по 1-180', 1.6, 2.0, 8.3, 58], ['Суп-пюре из моркови по 1-182', 1.2, 1.8, 4.5, 39], ['Суп-пюре из печени', 3.7, 4.1, 4.3, 67.9], ['Суп-пюре из птицы', 4.8, 6.8, 3.5, 93.1], ['Суп-пюре из разных овощей', 2.3, 2.8, 7.0, 60.3], ['Суп-пюре из рисовой крупы по 1-186', 1.4, 1.3, 7.7, 48], ['Суп-пюре из свежих помидоров', 1.8, 3.1, 1.4, 40.5], ['Суп-пюре из черники', 0.3, 1.3, 5.5, 33.5], ['Суп-пюре из шпината по 1-184', 1.9, 2.0, 4.0, 42], ['Суп-салат "Садовый"', 5.6, 2.8, 4.0, 62.8], ['Суп-харчо', 2.2, 2.1, 4.3, 43.9], ['Суп-харчо (грузинское национальное блюдо)', 4.8, 5.5, 5.0, 87.9], ['Сырный суп', 4.7, 6.9, 3.2, 93.4], ['Уха ладожская с кнелями и расстегаями', 13.4, 2.5, 2.5, 85.2], ['Уха ростовская', 8.5, 2.2, 4.4, 70.1], ['Уха рыбацкая', 8.5, 1.9, 4.3, 66.7], ['Уха с перловой крупой', 9.3, 1.0, 5.4, 66.3], ['Уха с расстегаями', 10.4, 2.9, 4.7, 85.3], ['Фасолевый суп', 2.3, 1.6, 6.6, 48.1], ['Харчо', 8.0, 3.6, 13.6, 114.9], ['Хирмаса (суп из субпродуктов с лапшой домашней - бурятское национальное блюдо)', 4.3, 5.5, 5.0, 85.6], ['Холодный борщ с редькой', 0.9, 2.0, 2.9, 32.3], ['Щи боярские', 3.5, 2.6, 2.9, 48.3], ['Щи зеленые с яйцом', 1.9, 3.2, 2.2, 44.9], ['Щи из квашеной капусты', 2.0, 2.8, 1.0, 37.2], ['Щи из квашеной капусты', 0.8, 1.7, 2.6, 28.7], ['Щи из квашеной капусты по 1-132', 0.8, 1.0, 1.5, 19], ['Щи из клевера и щавеля', 3.3, 8.9, 6.1, 116.3], ['Щи из свежей белокочанной капусты', 0.5, 0.8, 2.2, 17.1], ['Щи из свежей капусты', 1.0, 1.9, 3.4, 33.3], ['Щи из свежей капусты по 1-130', 0.9, 1.1, 2.5, 24], ['Щи из свежей капусты с картофелем', 1.1, 2.1, 4.9, 41.6], ['Щи из щавеля', 2.1, 3.1, 2.4, 45.3], ['Щи из щавеля по 1-132', 2.3, 3.5, 1.8, 48], ['Щи по-уральски (с крупой)', 0.8, 1.8, 3.2, 31.5], ['Щи с ячневой крупой', 2.3, 3.6, 1.6, 47.6], ['Щи суточные', 1.7, 3.2, 2.8, 46.3], ['Щи суточные по 1-134', 0.9, 1.0, 1.5, 19], ['Щи томленые с гречневыми блинами', 3.5, 3.7, 2.6, 56.8], ['Юшка картофельная с кабачками и помидорами', 3.5, 4.3, 6.0, 74.6], ['Яблочный суп со сметаной', 0.8, 3.2, 4.9, 50.5]],
            fish: [['Акула катран', 19.9, 7.0, 0.0, 143], ['Акула, все виды, приготовленная, обжаренная в панировке', 18.62, 13.82, 6.39, 228], ['Акула, все виды, сырая', 20.98, 4.51, 0.0, 130], ['Альбула', 23.0, 1.5, 0.0, 106], ['Анчоус атлантический', 20.1, 6.1, 0.0, 135], ['Анчоус европейский, консервированный в масле, сухой продукт без маринада', 28.89, 9.71, 0.0, 210], ['Анчоус европейский, сырой', 20.35, 4.84, 0.0, 131], ['Аргентина', 17.6, 2.0, 0.0, 88], ['Асцидия, (tunughnak), (Аляска)', 3.8, 0.5, 0.0, 20], ['Балык осетровый вяленый', 21.6, 10.1, 0.0, 177], ['Балык осетровый холодного копчения', 20.4, 12.5, 0.0, 194], ['Барабулька, приготовленная на жару', 24.81, 4.86, 0.0, 150], ['Барабулька, сырая', 19.35, 3.79, 0.0, 117], ['Баттерфиш, весенне-летняя', 17.3, 7.9, 0.0, 140], ['Баттерфиш, осенне-зимняя', 17.3, 14.6, 0.0, 201], ['Белая рыба, все виды', 19.09, 5.86, 0.0, 134], ['Белая рыба, все виды, копченая', 23.4, 0.93, 0.0, 108], ['Белая рыба, все виды, приготовленная на жару', 24.47, 7.51, 0.0, 172], ['Белоглазка аральская холодного копчения', 27.5, 14.9, 0.0, 244], ['Белоглазка, аральская', 17.9, 8.0, 0.0, 144], ['Белоглазка, волго-каспийская', 18.8, 1.9, 0.0, 92], ['Белорыбица', 20.1, 21.5, 0.0, 274], ['Белуга бланшированная консервированная', 23.3, 15.6, 0.0, 234], ['Белуга, глаза (Аляска)', 19.6, 23.3, 0.0, 291], ['Бельдюга американская, приготовленная на жару', 21.33, 1.17, 0.0, 102], ['Бельдюга американская, сырая', 16.64, 0.91, 0.0, 79], ['Бельдюга океаническая', 17.6, 2.1, 0.0, 89], ['Берикс', 20.3, 0.8, 0.0, 88], ['Бесуго', 20.0, 7.2, 0.0, 145], ['Боковник белужий холодного копчения', 18.2, 17.2, 0.0, 228], ['Большеголов', 11.4, 5.4, 0.0, 94], ['Большеголов атлантический', 16.41, 0.7, 0.0, 76], ['Большеголов атлантический, приготовленный на жару', 22.64, 0.9, 0.0, 105], ['Бульон рыбный', 2.26, 0.81, 0.0, 17], ['Бычки в томатном соусе, консервы', 12.8, 8.1, 5.2, 145], ['Бычок-песочник', 15.8, 0.8, 0.0, 70], ['Вобла', 18.0, 2.8, 0.0, 95], ['Вобла каспийская вяленая', 46.4, 5.5, 0.0, 235], ['Вобла холодного копчения', 31.1, 6.3, 0.0, 181], ['Галиотис, все виды, жареный', 19.63, 6.78, 11.05, 189], ['Галиотис, все виды, сырой', 17.1, 0.76, 6.01, 105], ['Галки из трески, по 1-388', 12.0, 1.1, 7.3, 87], ['Гирелла, черный каменный окунь, сырой, (Аляска)', 15.5, 1.75, 0.0, 82], ['Гладкоголов', 8.0, 1.9, 0.0, 49], ['Горбуша', 20.5, 6.5, 0.0, 140], ['Горбуша в томатном соусе. Консервы', 15.0, 6.0, 4.1, 130], ['Горбуша натуральная. Консервы', 20.9, 5.8, 0.0, 136], ['Горбуша отварная, по 1-342', 21.8, 7.3, 0.0, 152], ['Горбуша соленая', 22.1, 9.0, 0.0, 169], ['Горбуша, консервированная без соли, с маринадом и костями', 19.78, 6.05, 0.0, 139], ['Горбуша, консервированная, содержимое без жидкости', 23.1, 5.02, 0.0, 138], ['Горбуша, консервированная, содержимое без жидкости, без кожи и костей', 24.62, 4.21, 0.0, 136], ['Горбуша, приготовленная на жару', 24.58, 5.28, 0.0, 153], ['Горбуша, с костями, консервированная', 19.68, 4.97, 0.0, 129], ['Горбуша, сырая', 20.5, 4.4, 0.0, 127], ['Горбыль волнистый, жареный в панировке', 18.2, 12.67, 7.14, 221], ['Горбыль волнистый, сырой', 17.78, 3.17, 0.0, 104], ['Горбыль, приготовленный на жару', 22.49, 6.32, 0.0, 153], ['Горбыль, сырой', 17.54, 4.93, 0.0, 119], ['Гребешок', 12.06, 0.49, 3.18, 69], ['Гребешок, искусственный из сурими', 12.77, 0.41, 10.62, 99], ['Гребешок, обжаренный в панировке', 18.07, 10.94, 10.13, 216], ['Гребешок, приготовленный на пару', 20.54, 0.84, 5.41, 111], ['Групер, все виды, приготовленный на жару', 24.84, 1.3, 0.0, 118], ['Групер, все виды, сырой', 19.38, 1.02, 0.0, 92], ['Джакас', 20.3, 4.3, 0.0, 120], ['Дночерпатель,все виды, приготовленный на жару', 26.3, 1.72, 0.0, 128], ['Дночерпатель,все виды, сырой', 20.51, 1.34, 0.0, 100], ['Дрепана', 19.4, 1.1, 0.0, 88], ['Ерш морской дальневосточный', 16.6, 9.3, 0.0, 150], ['Желтоперка', 17.9, 4.0, 0.0, 108], ['Жерех', 18.8, 2.6, 0.0, 99], ['Жир тюленя, (Ларга, или пестрая нерпа), (Аляска)', 0.0, 99.32, 0.0, 894], ['Зеленоглазка', 19.6, 4.3, 0.0, 117], ['Зразы из судака, по 1-382', 12.1, 7.4, 12.1, 164], ['Зразы из хека, по 1-374', 13.1, 5.6, 9.3, 140], ['Зубан', 18.8, 6.3, 0.0, 132], ['Зубатка атлантическая', 17.5, 2.39, 0.0, 96], ['Зубатка атлантическая, приготовленная на жару', 22.44, 3.06, 0.0, 123], ['Зубатка жареная, по 1-364', 22.2, 11.5, 4.1, 209], ['Зубатка запеченная в сметанном соусе, по 1-376', 7.4, 8.8, 6.8, 137], ['Зубатка отварная, по 1-342', 19.0, 5.1, 0.0, 122], ['Зубатка пестрая', 19.6, 5.3, 0.0, 126], ['Зубатка полосатая', 16.0, 5.0, 0.0, 109], ['Икра белужья зернистая, соленая', 26.8, 13.8, 0.8, 235], ['Икра вобельная пробойная, соленая', 23.9, 5.1, 0.0, 142], ['Икра вобельная ястычная (тарама), соленая', 24.9, 5.7, 0.0, 151], ['Икра горбуши зернистая, соленая', 30.6, 11.5, 1.0, 230], ['Икра кеты зернистая, соленая', 31.5, 13.2, 1.0, 249], ['Икра лещевая пробойная, соленая', 24.7, 4.8, 0.0, 142], ['Икра лобанья вяленая, соленая', 34.4, 40.8, 0.0, 505], ['Икра минтая пробойная, соленая', 27.9, 1.8, 1.1, 132], ['Икра осетровая зернистая, соленая', 28.4, 9.3, 0.6, 200], ['Икра осетровая паюсная, соленая', 38.2, 14.5, 1.5, 289], ['Икра сазанья пробойная, соленая', 25.1, 2.5, 0.0, 123], ['Икра севрюги зернистая, соленая', 28.2, 11.7, 0.7, 221], ['Икра сельди тихоокеанской, свежая', 9.6, 1.93, 4.47, 74], ['Икра сельди тихоокеанской, сухая', 60.4, 6.6, 2.8, 312], ['Икра сиговых рыб, свежая', 14.66, 2.88, 4.89, 104], ['Икра, черная и красная, зернистая, соленая', 24.6, 17.9, 4.0, 264], ['Кабан-рыба', 14.1, 18.2, 0.0, 220], ['Кальмар', 18.0, 2.2, 2.0, 100], ['Кальмар, все виды, жареный', 17.94, 7.48, 7.79, 175], ['Кальмар, все виды, сырой', 15.58, 1.38, 3.08, 92], ['Камбала (морская и речная), приготовленная на жару', 15.24, 2.37, 0.0, 86], ['Камбала (морская и речная), сырая', 12.41, 1.93, 0.0, 70], ['Камбала в томатном соусе, консервы', 12.6, 5.4, 6.3, 125], ['Камбала дальневосточная', 15.7, 3.0, 0.0, 90], ['Камбала обжаренная в масле. Консервы', 14.4, 21.8, 0.0, 254], ['Камбала полярная', 16.4, 2.3, 0.0, 86], ['Камбала речная горячего копчения', 22.0, 11.6, 0.0, 192], ['Камбала черноморская', 18.2, 1.3, 0.0, 84.5], ['Камбала-ерш', 15.5, 2.7, 0.0, 86], ['Каракатица, все виды, приготовленная на пару', 32.48, 1.4, 1.64, 158], ['Каракатица, все виды, сырая', 16.24, 0.7, 0.82, 79], ['Карась', 17.7, 1.8, 0.0, 87], ['Карась морской', 20.4, 1.4, 0.0, 91], ['Карась морской, приготовленный на жару', 26.02, 1.63, 0.0, 126], ['Карась морской, сырой', 20.21, 2.41, 0.0, 108], ['Карп', 16.0, 5.3, 0.0, 112], ['Карп жареный, по 1-364', 18.5, 10.5, 3.2, 181], ['Карп, сырой', 17.83, 5.6, 0.0, 127], ['Карп, сырой, приготовленный на жару', 22.86, 7.17, 0.0, 162], ['Кафельник, приготовленный на жару', 24.49, 4.69, 0.0, 147], ['Кафельник, сырой', 17.5, 2.31, 0.0, 96], ['Кета', 19.0, 5.6, 0.0, 127], ['Кета в томатном соусе, консервы', 19.7, 8.2, 4.1, 168], ['Кета натуральная, консервы', 21.5, 4.8, 0.0, 129], ['Кета соленая', 24.3, 9.6, 0.0, 184], ['Кета, консервированная без соли, сухой продукт без маринада с костями', 21.43, 5.5, 0.0, 141], ['Кета, приготовленная на жару', 25.82, 4.83, 0.0, 154], ['Кета, сухой продукт без маринада с костями', 21.43, 5.5, 0.0, 141], ['Кета, сушеная, (Аляска)', 62.09, 14.38, 0.0, 378], ['Кета, сырая', 20.14, 3.77, 0.0, 120], ['Кета, сырая, (Аляска)', 20.69, 3.67, 0.0, 116], ['Кефаль холодного копчения', 23.8, 11.5, 0.0, 199], ['Кижуч', 21.6, 6.0, 0.0, 140], ['Кижуч (серебряный лосось), сырой, (Аляска)', 22.56, 5.57, 0.0, 140], ['Кижуч консервированный', 17.9, 7.4, 0.0, 140], ['Кижуч, дикий, приготовленный на жару', 23.45, 4.3, 0.0, 139], ['Кижуч, дикий, приготовленный на пару', 27.36, 7.5, 0.0, 184], ['Кижуч, дикий, сырой', 21.62, 5.93, 0.0, 146], ['Кижуч, разведенный на ферме, приготовленный на жару', 24.3, 8.23, 0.0, 178], ['Кижуч, разведенный на ферме, сырой', 21.27, 7.67, 0.0, 160], ['Килька балтийская', 14.1, 9.0, 0.0, 137], ['Килька балтийская горячего копчения', 21.3, 8.5, 0.0, 162], ['Килька балтийская соленая', 17.1, 7.6, 0.0, 137], ['Килька каспийская', 18.5, 13.1, 0.0, 192], ['Килька соленая с картофелем и маслом, по 1-100', 11.3, 12.2, 9.2, 192], ['Килька соленая с луком и маслом, по 1-98', 10.0, 13.8, 1.1, 169], ['Китовое мясо', 22.5, 3.2, 0.0, 119], ['Китовые, белуга, мясо сушеное (Аляска)', 69.86, 5.34, 0.0, 327], ['Китовые, белуга, мясо сырое (Аляска)', 26.5, 0.5, 0.0, 111], ['Китовые, белуга, плавник сырой (Аляска)', 19.0, 21.7, 0.0, 271], ['Клыкач', 14.4, 16.1, 0.0, 203], ['Корифена, приготовленная на жару', 23.72, 0.9, 0.0, 109], ['Корифена, сырая', 18.5, 0.7, 0.0, 85], ['Корюшка зубастая, азиатская', 15.4, 4.5, 0.0, 102], ['Корюшка, сушеная, (Аляска)', 56.19, 17.9, 0.0, 386], ['Котлеты из трески, по 1-380', 12.6, 5.9, 15.0, 164], ['Краб дандженесский, приготовленный на пару', 22.32, 1.24, 0.95, 110], ['Краб дандженесский, сырой', 17.41, 0.97, 0.74, 86], ['Краб камчатский (мясо)', 18.2, 1.0, 0.0, 82], ['Краб камчатский, приготовленный на пару', 19.35, 1.54, 0.0, 97]],
            gar: [['Бобовые в соусе', 26.2, 7.0, 48.0, 347.7], ['Бобовые отварные', 30.4, 7.2, 54.7, 391.5], ['Бобовые отварные', 24.2, 1.8, 43.6, 276.8], ['Гарнир из овощей 1', 8.4, 7.7, 17.0, 167.1], ['Гарнир из овощей 2', 1.0, 0.2, 3.6, 18.8], ['Гарнир из овощей 3', 1.5, 3.4, 7.6, 65.2], ['Гарнир из овощей 4', 4.3, 12.9, 12.7, 180.5], ['Гарнир из овощей 5', 1.8, 0.3, 8.6, 42.4], ['Гарнир из овощей 6', 5.9, 0.6, 11.9, 73.5], ['Гарнир из овощей 7', 8.0, 1.8, 3.8, 62.3], ['Гарнир из овощей 8', 0.6, 0.4, 10.9, 47.1], ['Гарнир из овощей 9', 10.0, 1.5, 13.0, 102.4], ['Гарнир из овощей к сельди и отварной рыбе 1', 2.5, 0.4, 12.2, 58.9], ['Гарнир из овощей к сельди и отварной рыбе 2', 2.0, 0.3, 9.0, 44], ['Гарнир из овощей к сельди и отварной рыбе 3', 2.0, 0.3, 9.1, 44.6], ['Гарнир из овощей к сельди и отварной рыбе 4', 3.5, 1.9, 7.1, 57.1], ['Гарнир сложный 1', 3.5, 7.7, 16.1, 143.4], ['Гарнир сложный 10', 3.5, 11.3, 19.8, 189.8], ['Гарнир сложный 11', 16.1, 10.6, 46.2, 333.2], ['Гарнир сложный 12', 9.9, 5.6, 29.9, 201.9], ['Гарнир сложный 13', 4.5, 13.4, 15.9, 198.5], ['Гарнир сложный 15', 4.2, 16.3, 25.2, 257.5], ['Гарнир сложный 16', 5.1, 3.3, 17.1, 114.4], ['Гарнир сложный 17', 7.2, 5.8, 27.1, 182.7], ['Гарнир сложный 18', 4.6, 7.4, 20.0, 160.3], ['Гарнир сложный 19', 7.1, 0.9, 23.0, 122.7], ['Гарнир сложный 2', 20.1, 13.0, 50.0, 384.9], ['Гарнир сложный 3', 6.1, 9.5, 28.2, 216.1], ['Гарнир сложный 5', 3.2, 7.2, 26.0, 174.9], ['Гарнир сложный 6', 6.3, 9.5, 27.4, 212.9], ['Гарнир сложный 7', 5.1, 6.4, 16.5, 140.3], ['Гарнир сложный 8', 3.4, 11.5, 15.8, 176.2], ['Гарниры к сладким супам', 6.2, 6.9, 41.8, 243.9], ['Капуста "Невская"', 1.7, 0.1, 5.5, 28.3], ['Капуста жареная', 2.8, 3.3, 5.3, 60.6], ['Картофель в молоке', 2.8, 4.7, 11.8, 97.6], ['Картофель в молоке', 3.4, 4.8, 20.6, 133.6], ['Картофель в молоке', 2.2, 5.0, 10.4, 93.3], ['Картофель в фольге', 1.9, 2.8, 10.8, 73.5], ['Картофель жаренный во фритюре', 4.7, 17.8, 26.6, 279], ['Картофель жареный (из вареного)', 3.6, 11.7, 24.5, 211.5], ['Картофель жареный (из сырого)', 3.7, 10.6, 24.8, 203.3], ['Картофель молодой в сметане', 2.1, 14.0, 7.2, 161.1], ['Картофель по домашнему', 5.3, 18.4, 16.3, 247.7], ['Картофель, запеченный в сметанном соусе', 3.7, 19.5, 14.5, 245.2], ['Картофель, запеченный со свининой', 7.8, 22.9, 16.6, 299.5], ['Картофель, тушённый с грибами', 3.0, 14.2, 8.4, 171.3], ['Картофель, тушенный с грибами в сметане', 4.3, 10.1, 12.2, 153.6], ['Картофельная запеканка', 2.9, 4.3, 7.9, 79.8], ['Картофельная запеканка', 0.0, 0.0, 0.0, 0], ['Картофельная запеканка по-французски', 5.9, 4.7, 8.1, 96], ['Картофельная масса', 4.0, 1.0, 17.2, 89.4], ['Картофельное пюре', 2.1, 4.6, 8.5, 81.7], ['Картофельные крокеты', 2.6, 34.1, 7.6, 346], ['Картошка по Оксановски', 4.7, 10.0, 11.0, 150.1], ['Клецки', 5.0, 4.8, 25.8, 160.3], ['Клецки в лимонном соусе', 1.9, 4.3, 10.8, 87], ['Клецки из капусты', 1.2, 1.3, 1.3, 21.5], ['Лапша домашняя', 9.7, 3.1, 50.5, 255.9], ['Морковь, пассерованная в масле', 0.9, 10.2, 8.5, 127.4], ['Плов', 4.1, 7.3, 18.3, 150.7], ['Помидоры с рисом', 0.0, 0.0, 0.0, 0], ['Помидоры, баклажаны и другие овощи жареные', 1.2, 10.6, 5.1, 119.4], ['Профитроли', 9.6, 16.0, 18.7, 253], ['Пюре из кабачков', 1.1, 12.4, 3.8, 129.8], ['Пюре из картофеля и капусты', 2.2, 2.8, 7.0, 60.4], ['Пюре из картофеля и тыквы', 1.8, 4.8, 6.6, 75.4], ['Пюре из картофеля и шпината', 1.9, 4.8, 5.2, 70.6], ['Пюре из моркови', 1.7, 8.4, 6.3, 105.7], ['Пюре из репчатого лука', 1.8, 0.7, 8.2, 44.4], ['Пюре картофельное', 2.7, 5.9, 12.9, 112], ['Свекла пикантная', 1.3, 1.6, 10.3, 58.3], ['Суфле из брюквы', 1.7, 11.6, 9.5, 147.2]],
            mushr: [['Белый гриб', 3.7, 1.7, 1.1, 34], ['Белый гриб сушеный', 30.3, 14.3, 9.0, 286], ['Белый гриб, быстро обжаренный (стир-фрай)', 3.58, 0.33, 2.24, 26], ['Белый гриб, вареный, без соли', 2.17, 0.47, 3.09, 28], ['Белый гриб, вареный, с солью', 2.17, 0.47, 3.09, 28], ['Белый гриб, выращенный под ультрафиолетом', 3.09, 0.34, 2.26, 22], ['Белый гриб, приготовленный в микроволновке', 3.91, 0.46, 3.54, 35], ['Белый гриб, сырой', 3.09, 0.34, 2.26, 22], ['Вешенки', 2.9, 0.188, 4.09, 33.3], ['Грибы жареные (сушеные) по 1-268', 11.3, 24.4, 1.2, 270], ['Грибы жареные в сметанном соусе по 1-242', 6.7, 14.5, 3.5, 172], ['Грибы жареные с картофелем по 1-242', 3.9, 5.2, 12.7, 114], ['Грибы, запеченные в сметанном соусе по 1-260', 6.5, 16.6, 3.2, 188], ['Грибы, консервированные, содержимое без жидкости', 1.87, 0.29, 2.69, 25], ['Грибы, тушенные с картофелем по 1-228', 4.0, 6.4, 10.7, 117], ['Груздь', 1.8, 0.8, 0.5, 16], ['Лисички', 1.49, 0.53, 3.06, 32], ['Лисички', 1.5, 1.1, 1.0, 19], ['Маслята', 2.4, 0.7, 0.5, 9], ['Опенок', 2.2, 1.2, 0.5, 22], ['Подберезовик', 2.3, 0.9, 1.2, 20], ['Подберезовик сушеный', 23.5, 9.2, 14.3, 231], ['Подосиновик', 3.3, 0.5, 1.2, 22], ['Подосиновик сушеный', 35.4, 5.4, 12.9, 299], ['Портобелло, грибы', 2.11, 0.35, 2.57, 22], ['Портобелло, грибы приготовленные на гриле', 3.28, 0.58, 2.24, 29], ['Портобелло, грибы, выращенные под ультрафиолетом', 2.11, 0.35, 2.57, 22], ['Портобелло, грибы, выращенные под ультрафиолетом, приготовленные на гриле', 3.28, 0.58, 2.24, 29], ['Рыжик', 1.9, 0.8, 0.5, 22], ['Сморчок, гриб', 3.12, 0.57, 2.3, 31], ['Сморчок, гриб', 2.9, 0.4, 0.2, 22], ['Соломенные грибы, консервированные, содержимое без жидкости', 3.83, 0.68, 2.14, 32], ['Сыроежки', 1.7, 0.7, 1.5, 19], ['Чернушка', 0.0, 0.0, 0.0, 0], ['Шампиньоны', 4.3, 1.0, 0.1, 27], ['Шампиньоны, выращенные под ультрафиолетом', 2.5, 0.1, 3.7, 22], ['Шампиньоны, сырые', 2.5, 0.1, 3.7, 22], ['Шиитаке, грибы', 2.24, 0.49, 4.29, 34], ['Шиитаке, грибы быстро обжаренные (стир-фрай)', 3.45, 0.35, 4.08, 39], ['Шиитаке, грибы приготовленные, без соли', 1.56, 0.22, 12.29, 56], ['Шиитаке, грибы приготовленные, с солью', 1.56, 0.22, 12.29, 56], ['Шиитаке, грибы сушеные', 9.58, 0.99, 63.87, 296], ['Эноки (опёнок зимний, энокитаки), грибы', 2.66, 0.29, 5.11, 37]],
            salad: [['Винегрет', 1.7, 10.3, 8.2, 130.1], ['Винегрет из овощей', 1.9, 13.9, 11.7, 176.9], ['Винегрет из овощей и фруктов', 1.9, 9.5, 11.9, 137.4], ['Винегрет из овощей, яблок и зелени', 1.6, 7.3, 8.6, 104.2], ['Винегрет из перца с картофелем', 3.0, 6.2, 7.9, 97.4], ['Винегрет из фруктов и овощей', 2.1, 8.2, 12.4, 128.5], ['Винегрет овощной', 1.7, 4.9, 6.8, 76.6], ['Винегрет овощной', 5.7, 8.4, 16.2, 158.7], ['Винегрет по-румынски', 6.2, 16.8, 8.7, 208.1], ['Винегрет с консервированным мясом', 10.3, 15.4, 9.5, 215], ['Винегрет с селедкой', 4.5, 6.9, 10.5, 119.1], ['Винегрет с сельдью', 9.1, 13.0, 6.8, 179.2], ['Диетический салат из свеклы и яблок', 0.8, 3.0, 17.0, 94.2], ['Жареный салат "Универсал"', 1.0, 0.2, 5.5, 26.6], ['Морковный салат', 0.8, 7.5, 4.7, 88.2], ['Морковь с помидорами и яблоками', 0.8, 1.6, 7.0, 44.4], ['Огуречный салат', 3.7, 12.0, 2.2, 131.5], ['Окрошка', 3.7, 5.1, 4.0, 75.7], ['Окрошка', 2.4, 3.2, 5.0, 57.2], ['Окрошка мясная', 7.0, 4.8, 4.6, 89.1], ['Окрошка овощная', 1.9, 1.9, 6.4, 48.1], ['Окрошка сборная мясная', 5.1, 6.4, 4.6, 95.1], ['Оригинальный салат', 0.0, 0.0, 0.0, 0], ['Пестрый летний салат', 0.0, 0.0, 0.0, 0], ['Пестрый салат', 3.7, 1.9, 11.2, 73.9], ['Печеночный салат', 8.2, 7.5, 1.1, 104.7], ['Пикантный салат', 0.0, 0.0, 0.0, 0], ['Помидоры с огурцами и перцем', 1.0, 0.9, 5.0, 30.7], ['Помидоры с огурцами и яблоками', 0.8, 4.9, 4.8, 65.7], ['Помидоры с чесночной заправкой', 3.9, 1.9, 10.1, 70.9], ['Помидоры, фаршированные салатом из яблок и огурцов', 0.0, 0.0, 0.0, 0], ['Помидоры, фаршированные салатом из яблок и огурцов.', 0.7, 3.2, 5.8, 53.5], ['Редиска со сметаной', 2.7, 9.0, 3.0, 103.5], ['Редька в сметане', 2.0, 9.2, 5.5, 111.8], ['Рыбный салат', 5.1, 12.0, 4.5, 145.6], ['Рыбный салат', 9.3, 18.3, 1.4, 207], ['Салат "Ак-идель" (рыбный с рисом по-башкирски)', 18.4, 29.6, 7.5, 368.8], ['Салат "Архиерейский"', 5.9, 20.8, 3.0, 221.5], ['Салат "Весна"', 3.0, 7.4, 3.1, 90.3], ['Салат "Гнездо глухаря"', 0.0, 0.0, 0.0, 0], ['Салат "Гранат"', 4.7, 18.0, 12.0, 225.9], ['Салат "Гранатовый браслет"', 3.9, 14.2, 6.1, 166.6], ['Салат "Грибки"', 6.5, 4.7, 2.6, 77.6], ['Салат "Золушка"', 0.0, 0.0, 0.0, 0], ['Салат "Киевский"', 5.0, 12.0, 8.8, 160.9], ['Салат "Копенгагенский"', 3.0, 4.8, 5.4, 75.7], ['Салат "Кремлевский"', 5.8, 22.1, 7.9, 252.3], ['Салат "Летний"', 3.6, 7.5, 5.4, 102.5], ['Салат "Матрешки"', 11.4, 8.4, 1.2, 125.9], ['Салат "Мимоза"', 6.3, 28.3, 4.4, 296.6], ['Салат "Молдова"', 5.5, 20.4, 20.7, 283.5], ['Салат "Московский"', 4.7, 24.7, 10.5, 280.3], ['Салат "Невеста"', 4.3, 18.5, 9.4, 218.7], ['Салат "Нежность"', 5.1, 8.7, 30.0, 211], ['Салат "Обжарка"', 3.8, 11.9, 2.7, 132.6], ['Салат "Осенний" из свежих овощей с рыбой', 8.3, 7.7, 5.5, 123], ['Салат "Острый" из картофеля с ветчиной и чесноком', 5.9, 10.3, 15.5, 175], ['Салат "Петровский" грибной с квашеной капустой и огурцами', 1.5, 10.3, 3.1, 110.5], ['Салат "Приятное с полезным"', 8.5, 0.7, 16.5, 101.7], ['Салат "Тихая заводь"', 7.8, 23.5, 4.6, 259.9], ['Салат "Универсал"', 1.0, 0.2, 5.6, 27.2], ['Салат "Фантазия"', 0.0, 0.0, 0.0, 0], ['Салат "Цезарь"', 14.8, 17.2, 24.0, 303.6], ['Салат "Цезарь" классический', 0.0, 0.0, 0.0, 0], ['Салат "Эгоист"', 10.5, 19.5, 9.2, 252.3], ['Салат "Эксклюзив"', 7.2, 6.8, 2.9, 100.4], ['Салат "Экспериментальный"', 2.6, 4.2, 9.8, 85], ['Салат "Эстонский"', 2.3, 14.2, 7.8, 166.2], ['Салат витаминный - 1', 1.3, 7.4, 7.8, 101], ['Салат витаминный - 2', 1.4, 7.7, 10.3, 113.7], ['Салат гороховый с яблоками', 3.3, 5.3, 11.2, 102.3], ['Салат греческий', 3.9, 17.8, 3.4, 188.5], ['Салат для мужчин', 1.6, 10.0, 8.3, 127.5], ['Салат из апельсинов и лука-порея', 0.0, 0.0, 0.0, 0], ['Салат из белокачанной капусты', 1.8, 3.6, 7.6, 67.9], ['Салат из белокочанной и морской капусты', 1.8, 5.1, 8.4, 84.6], ['Салат из белокочанной капусты с кальмарами', 14.0, 17.7, 3.7, 229.5], ['Салат из белокочанной капусты с сельдью и шпиком', 13.0, 13.0, 4.4, 185.6], ['Салат из белокочанной капусты с яблоками и сельдереем', 1.6, 5.0, 9.0, 85.3], ['Салат из белых грибов или шампиньонов', 5.2, 2.5, 5.2, 62.3], ['Салат из бобов', 3.3, 13.9, 5.0, 157.4], ['Салат из грибов и квашеной капусты', 2.0, 8.7, 8.9, 120.3], ['Салат из грибов с сельдью', 8.2, 10.8, 1.6, 135.7], ['Салат из зелени с дичью', 6.8, 18.5, 9.7, 230.4], ['Салат из кабачков и помидоров', 1.1, 9.0, 4.8, 103.4], ['Салат из кальмаров с яблоками', 16.4, 21.6, 14.7, 315.3], ['Салат из капусты с апельсинами', 2.5, 5.3, 11.1, 99.1], ['Салат из капусты с грибами', 5.9, 5.5, 9.0, 106.6], ['Салат из капусты с яблоками', 1.5, 0.2, 6.5, 32.4], ['Салат из капусты с яблоками', 2.5, 3.1, 6.0, 60.2], ['Салат из капусты с яблоками и луком', 1.1, 2.3, 12.4, 71.7], ['Салат из картофеля с морской капустой и свеклой', 2.1, 7.8, 9.4, 114], ['Салат из картофеля с редькой и яблоками', 4.2, 17.9, 7.5, 205.8], ['Салат из квашенной капусты', 1.6, 3.1, 11.6, 77.8], ['Салат из квашенной капусты и свеклы', 1.9, 5.0, 4.6, 69.9], ['Салат из квашеной капусты', 1.4, 8.1, 6.2, 101.7], ['Салат из квашеной капусты с селью', 8.0, 11.4, 8.3, 165.3], ['Салат из кильки в томатном соусе', 5.0, 27.2, 5.0, 283.5], ['Салат из кольраби', 2.1, 12.3, 7.0, 144.8], ['Салат из крабов', 14.7, 9.5, 7.3, 171.8], ['Салат из красного сладкого перца, зеленого горошка и риса', 10.0, 5.3, 42.4, 247.2], ['Салат из краснокачанной капусты', 0.8, 3.6, 7.8, 64.4], ['Салат из краснокачанной капусты с яблоками', 0.7, 0.3, 8.6, 38.1], ['Салат из краснокочанной капусты', 0.5, 6.1, 7.8, 86.8], ['Салат из краснокочанной капусты с грибами', 1.8, 6.5, 8.4, 97.4], ['Салат из креветок с рисом', 25.6, 10.3, 30.6, 310.1], ['Салат из кукурузы', 8.8, 8.5, 54.8, 317.6], ['Салат из курицы по-архангельски', 4.7, 15.0, 11.3, 195.9], ['Салат из маринованной свеклы с яблоками', 1.3, 6.1, 8.0, 90.1], ['Салат из моркови', 5.7, 7.6, 26.8, 191.8], ['Салат из моркови и капусты', 1.7, 11.0, 9.2, 140.6], ['Салат из моркови с курагой, помидорами и яблоками', 1.2, 2.8, 12.8, 78.2], ['Салат из моркови с орехами и медом', 4.9, 15.2, 16.7, 219.4], ['Салат из моркови с хреном', 1.9, 12.6, 5.4, 141.2], ['Салат из морского гребешка с огурцами', 9.0, 11.1, 3.3, 148.2], ['Салат из овощей с капустой морской', 2.0, 10.6, 9.1, 136.8], ['Салат из огурцов', 1.1, 4.5, 3.2, 57], ['Салат из огурцов', 0.0, 0.0, 0.0, 0], ['Салат из перца', 1.1, 16.9, 4.4, 173], ['Салат из помидоров', 4.4, 12.4, 4.4, 146], ['Салат из помидоров и огурцов', 0.7, 7.7, 4.5, 89.2], ['Салат из помидоров по-чилийски', 0.6, 0.2, 4.2, 19.9], ['Салат из помидоров, огурцов и сладкого перца', 1.1, 0.2, 5.2, 25], ['Салат из птицы или дичи', 5.6, 15.1, 10.9, 198.8], ['Салат из птицы или дичи', 11.2, 19.4, 6.3, 243.5], ['Салат из разных фруктов', 1.0, 11.9, 9.5, 147.3], ['Салат из редиса', 0.0, 0.0, 0.0, 0], ['Салат из редиски со метаной', 2.0, 9.3, 4.0, 106.4], ['Салат из редьки', 2.2, 19.1, 6.3, 204.2], ['Салат из редьки и картофеля по-кабардински', 4.7, 9.2, 7.3, 128.4], ['Салат из редьки с орехами', 0.0, 0.0, 0.0, 0], ['Салат из репы', 1.8, 9.4, 13.6, 142.6], ['Салат из рыбы', 10.5, 13.0, 6.9, 184.9], ['Салат из свежей капусты с мясом', 3.7, 12.8, 3.6, 143.1], ['Салат из свежих овощей', 1.6, 4.4, 8.3, 77.5], ['Салат из свеклы и хрена', 1.3, 5.2, 11.6, 95.6], ['Салат из свеклы с орехами', 1.7, 8.8, 8.5, 117.8], ['Салат из свеклы с сыром и чесноком', 7.1, 17.1, 7.8, 211.6], ['Салат из свеклы с хреном', 1.5, 0.1, 10.7, 46.8], ['Салат из свеклы с черносливом, орехами и чесноком', 7.1, 15.6, 30.7, 284], ['Салат из сельди', 11.9, 14.7, 6.4, 204.1], ['Салат из соленых огурцов и брюквы', 1.9, 3.7, 6.8, 66.6], ['Салат из соленых огурцов и редьки', 1.2, 7.7, 4.3, 90.8], ['Салат из соленых огурцов и свеклы', 1.4, 7.6, 5.6, 95], ['Салат из спаржи', 2.1, 23.9, 3.6, 237.5], ['Салат из стручковой фасоли', 16.1, 3.9, 31.1, 215.9], ['Салат из стручковой фасоли', 2.8, 10.5, 7.2, 132.5], ['Салат из сырой моркови и репы', 1.5, 8.8, 8.2, 115.9], ['Салат из сырой моркови м яблоками', 1.2, 4.8, 9.1, 82.2], ['Салат из сырой свеклы', 1.2, 4.7, 8.0, 76.7], ['Салат из сырых овощей', 1.6, 7.6, 5.3, 94.3], ['Салат из сырых овощей с яблоками', 1.1, 3.3, 6.4, 58], ['Салат из творога', 12.6, 19.2, 6.1, 246.4], ['Салат из трески с майонезом', 9.9, 15.0, 2.6, 184.6], ['Салат из трески с хреном', 8.9, 10.1, 10.0, 164.8], ['Салат из тыквы', 0.9, 6.1, 3.8, 73], ['Салат из тыквы по-чувашски', 1.2, 0.2, 20.4, 82.9], ['Салат из тыквы с яблоками', 0.6, 0.3, 8.2, 35.7], ['Салат из фасоли', 0.9, 0.9, 88.9, 345.2], ['Салат из фасоли', 13.8, 19.6, 28.1, 336.6], ['Салат из фруктов', 0.8, 4.9, 12.9, 95.2], ['Салат из цветной капусты', 1.8, 3.8, 3.1, 53.2], ['Салат из цветной капусты', 1.2, 5.7, 3.5, 69.1], ['Салат из цветной капусты, свежих огурцов и помидоров', 2.0, 5.3, 5.6, 77.3], ['Салат из шампиньонов', 3.9, 12.5, 4.0, 143.1], ['Салат из щавеля', 2.3, 18.8, 5.8, 200.1], ['Салат из яблок и брусники', 0.8, 5.0, 8.1, 78.6], ['Салат из яблок и лука', 1.0, 8.3, 8.6, 111.1], ['Салат из яблок и моркови с орехами', 4.1, 6.8, 19.9, 152.6], ['Салат из яблок и помидоров', 0.8, 4.1, 7.2, 67.1], ['Салат из яблок и сливы', 2.6, 2.2, 18.1, 97.9], ['Салат из яблок и тыквы', 0.6, 0.3, 8.3, 36.2], ['Салат из яблок с орехами', 1.7, 0.3, 17.6, 75.8], ['Салат картофельный', 2.5, 6.6, 15.5, 127.9], ['Салат картофельный с грибами и брусникой', 4.2, 9.1, 6.7, 123.6], ['Салат картофельный с грибами и клюквой', 4.2, 9.1, 6.7, 123.6], ['Салат картофельный с яблоками', 2.0, 7.9, 8.2, 109.5], ['Салат любительский', 1.5, 5.5, 11.2, 97.3], ['Салат Муравейник', 12.6, 7.9, 30.2, 235.4], ['Салат мясной', 7.1, 15.5, 9.9, 205.1], ['Салат мясной', 11.8, 20.7, 5.4, 254], ['Салат овощной с редькой и яблоками', 2.0, 13.5, 7.4, 157.3], ['Салат овощной с яблоками и сладким перцем', 1.4, 10.8, 5.7, 123.8], ['Салат освежающий с редькой', 1.7, 0.3, 10.3, 47.9], ['Салат осенний', 1.6, 6.1, 5.6, 82.1], ['Салат по-берлински', 1.9, 21.6, 4.8, 219.7], ['Салат по-деревенски', 2.6, 7.2, 10.1, 113.7], ['Салат по-коми-пермяцки (из квашеной капусты с мясом)', 10.5, 10.1, 2.8, 143], ['Салат по-французски', 2.1, 14.3, 7.9, 166.6], ['Салат по-чешски', 4.2, 18.4, 3.8, 196.6], ['Салат рыбный', 6.4, 12.4, 4.4, 153.3], ['Салат рыбный', 12.1, 15.7, 3.9, 204.2], ['Салат рыбный с морской капустой', 8.8, 7.5, 4.2, 119], ['Салат с кальмарами', 0.0, 0.0, 0.0, 0], ['Салат с колбасой', 4.0, 14.8, 8.9, 182.5], ['Салат с копченой треской', 6.9, 8.8, 4.0, 122.2], ['Салат с креветками', 7.7, 23.3, 2.7, 250.9], ['Салат с кукурузой', 7.4, 22.5, 23.4, 319.9], ['Салат с маслом и уксусом', 1.4, 15.8, 5.1, 167.2], ['Салат с сардинами', 6.1, 2.6, 10.0, 85.1], ['Салат с сельдереем и творогом', 0.0, 0.0, 0.0, 0], ['Салат сезонный', 2.1, 10.1, 8.2, 129.8], ['Салат со сметаной и яйцом', 1.8, 7.0, 3.0, 81.4], ['Салат столичный', 15.9, 27.8, 3.0, 325.2], ['Салат фруктовый со сметанным соусом', 1.1, 7.9, 16.6, 137.7], ['Салат яичный', 7.3, 19.5, 2.6, 214.2], ['Салат-коктейль "Экзотик"', 0.0, 0.0, 0.0, 0], ['Салат-коктейль овощной', 1.8, 12.8, 6.6, 147.4], ['Салат-коктейль рыбный', 13.9, 17.3, 1.7, 217.6], ['Салат-коктейль с ветчиной и сыром', 12.4, 23.8, 2.6, 273.6], ['Салат-коктейль с курицей и фруктами', 10.3, 19.1, 8.6, 245.1], ['Свекла в сладком маринаде', 0.4, 0.04, 12.4, 48.6], ['Свекла с клюквой', 1.5, 6.2, 11.2, 103.7], ['Селедка "под шубой"', 8.0, 18.2, 3.7, 209.5], ['Сельдь протертая с маслом', 16.1, 26.4, 4.4, 319], ['Сыр картофельный', 9.1, 9.6, 8.5, 154.6], ['Сыр слоеный', 16.0, 14.2, 1.1, 196.1], ['Сырный салат', 5.6, 11.6, 7.2, 153.4], ['Сырный салат', 0.0, 0.0, 0.0, 0], ['Фальшивый Оливье', 11.1, 8.8, 11.5, 167], ['Черемша с маслом (национальное блюдо народов Севера)', 3.4, 8.7, 8.6, 124.3], ['Яблочный салат с сельдереем и помидорами.', 0.0, 0.0, 0.0, 0], ['Яичный салат', 9.7, 15.1, 1.9, 181.7]],
            porValue: [0, 0, 0, 0, 0],
            qpor: 0,
            meatValue: [0, 0, 0, 0, 0],
            qmeat: 0,
            drinkValue: [0, 0, 0, 0, 0],
            qdrink: 0,
            breadValue: [0, 0, 0, 0, 0],
            qbread: 0,
            eggValue: [0, 0, 0, 0, 0],
            qegg: 0,
            milkValue: [0, 0, 0, 0, 0],
            qmilk: 0,
            fruitValue: [0, 0, 0, 0, 0],
            qfruit: 0,
            vegetablesValue: [0, 0, 0, 0, 0],
            qvegetables: 0,
            soupValue: [0, 0, 0, 0, 0],
            qsoup: 0,
            garValue: [0, 0, 0, 0, 0],
            qgar: 0,
            mushrValue: [0, 0, 0, 0, 0],
            qmushr: 0,
            saladValue: [0, 0, 0, 0, 0],
            qsalad: 0,
        }
    },
    methods: {
        nutrients(i) {
            return Math.trunc((this.porValue[i] * this.qpor / 100 + this.meatValue[i] * this.qmeat / 100 + this.drinkValue[i] * this.qdrink / 100 + this.breadValue[i] * this.qbread / 100 + this.eggValue[i] * this.qegg / 100 + this.milkValue[i] * this.qmilk / 100 + this.fruitValue[i] * this.qfruit / 100 + this.vegetablesValue[i] * this.qvegetables / 100) * 10) / 10
        },
        needcalories(meal) {
            let ans = 10 * this.weight + 6.25 * this.height - 5 * this.ages
            if (localStorage.data.gender == 'Man') {
                ans += 5
            }
            else {
                ans -= 161
            }
            return ans * this.act * (meal * 100) / 100
        },
        neednutrients(meal, coe) {
            return this.weight * coe * (meal * 100) / 100
        },
        next() {            this.part += 1
            this.result.push([])
            let last = this.result.length - 1
            if (this.porValue[0]) this.result[last].push([this.porValue[0], this.qpor])
            if (this.meatValue[0]) this.result[last].push([this.meatValue[0], this.qmeat])
            if (this.eggValue[0]) this.result[last].push([this.eggValue[0], this.qegg])
            if (this.drinkValue[0]) this.result[last].push([this.drinkValue[0], this.qdrin])
            if (this.breadValue[0]) this.result[last].push([this.breadValue[0], this.qbread])
            if (this.milkValue[0]) this.result[last].push([this.milkValue[0], this.qmilk])
            if (this.fruitValue[0]) this.result[last].push([this.fruitValue[0], this.qfruit])
            if (this.vegetablesValue[0]) this.result[last].push([this.vegetablesValue[0], this.qvegetables])
            if (this.soupValue[0]) this.result[last].push([this.soupValue[0], this.qsoup])
            if (this.garValue[0]) this.result[last].push([this.garValue[0], this.qgar])
            if (this.mushrValue[0]) this.result[last].push([this.mushrValue[0], this.qmush])
            if (this.saladValue[0]) this.result[last].push([this.saladValue[0], this.qsalad])
            this.porValue = ['', 0, 0, 0, 0]
            this.qpor = 0,
            this.meatValue = ['', 0, 0, 0, 0]
            this.qmeat = 0,
            this.drinkValue = ['', 0, 0, 0, 0]
            this.qdrink = 0,
            this.breadValue = ['', 0, 0, 0, 0]
            this.qbread = 0,
            this.eggValue = ['', 0, 0, 0, 0]
            this.qegg = 0,
            this.milkValue = ['', 0, 0, 0, 0]
            this.qmilk = 0,
            this.fruitValue = ['', 0, 0, 0, 0]
            this.qfruit = 0,
            this.vegetablesValue = ['', 0, 0, 0, 0]
            this.qvegetables = 0,
            this.soupValue = ['', 0, 0, 0, 0]
            this.qsoup = 0
            this.garValue = ['', 0, 0, 0, 0]
            this.qgar = 0
            this.mushrValue = ['', 0, 0, 0, 0]
            this.qmushr = 0
            this.saladValue = ['', 0, 0, 0, 0]
            this.qsalad = 0
        }
    },
    components: {
        Choice,
        ShowValue
    },
    mounted() {
        if (localStorage.data){
            this.islogin = true
        }
    },
    watch: {
        islogin(newislogin) {
            localStorage.islogin = newislogin
        }
    },
}
</script>
<style scoped>
.notlogin {
    width: 40%;
    height: 30%;
    margin: auto;
    margin-top: 15%;
    color: white;
    border: 2px solid white;
    border-radius: 100px;
}

.notice {
    margin: 15%;
}

.text {
    width: 95%;
    min-height: 80vh;
    margin: 7% auto;
    border-radius: 50px;
    background-color: black;
    color: white;
    text-align: center;
}

form {
    margin: auto;
    width: 30%;
    padding: 15%;
}

.submit {
    width: 80%;
    background-color: #4CAF50;
    padding: 14px 20px;
    margin: 3% 0;
}

.submit:hover {
    background-color: #45a049;
}

img {
    width: 10vw;
    height: 10vh;
}

.food {
    margin: 5% auto;
    display: flex;
    justify-content: space-around;
    flex-wrap: wrap;
    grid-gap: 1vh;
}

.products {
    display: flex;
    grid-gap: 1vh;
    flex-direction: column;
}

select {
    width: 10vw;
}

.total {
    display: flex;
    justify-content: space-evenly;
}

input[type="number"] {
    width: 10vw;
}

.requi {
    display: flex;
    flex-direction: column;
    width: 30vw;
    height: 80vh;
}

.item {
    text-align: left
}
</style>