const sqlite3 = require('sqlite3')
const food = new sqlite3.Database('database.db')

// food.run('CREATE TABLE IF NOT EXISTS veg(id INTEGER PRIMARY KEY AUTOINCREMENT, name REAL, proteins REAL, fats REAL, carbohydrates REAL, calories REAL)')

// setTimeout(() => {
//     // l = [['Свинина', '11,6', '49,1', '0', '484'], ['Говядина', '18,7', '12,6', '0', '191'], ['Баранина', '16,2', '15,3', '0', '201'], ['Телятина', '19,9', '1,1', '0', '91'], ['Кролик', '20,6', '12,8', '0', '197']]
//     // l = [['Гречневая каша рассыпчатая', '98,7', '3,6', '2,2', '17,1'], ['Каша "Янтарная"(из пшена я яблоками)', '138,9', '3,8', '6,5', '17,5'], ['Каша боярская (из пшена с изюмом)', '221,7', '4,8', '14,4', '19,5'], ['Каша вязкая из пшена с тыквой', '158', '4,2', '8', '18,5'], ['Каша гурьевская', '151,2', '4,4', '5,4', '22,6'], ['Каша из тыквы с манкой', '161,5', '2,8', '8,4', '19,9'], ['Каша манная коричневая', '162,1', '5,3', '6', '23,2'], ['Каша пшенная с сушеными сливами', '121,3', '2,4', '2,9', '22,7'], ['Каша рисовая с какао', '146,2', '4,1', '6', '20,3'], ['Манная каша на клюквенном соке', '112,7', '1,9', '4,6', '17'], ['Манная каша с морковью', '97,3', '2,7', '5,6', '9,7'], ['Мучная каша', '95,3', '3,4', '4,9', '10,2'], ['Рисовая каша с черносливом', '128,5', '1,9', '2,4', '26,4'], ['Рисовая с абрикосами по-венгерски', '119,7', '2,6', '0,3', '28,5'], ['Яблочно-манная каша', '128,4', '1,9', '4,3', '22'], ['Яичная каша (натуральная)', '180,3', '10,3', '11', '10,8'], ['Яичная каша с овощами или грибами', '261', '15,9', '13,2', '20,9'], ['Ячневая каша с картофелем', '48,6', '1,8', '1', '8,7']]
//     // l = [['Чай черный без сахара', '0', '0', '0', '0'], ['Чай зеленый без сахара', '0', '0', '0', '0'], ['Кофе с молоком', '0,8', '1', '11', '56'], ['Какао на молоке', '24', '17', '33,1', '377'], ['Хлебный квас', '0,2', '0', '5', '26'], ['Лимонад', '0', '0', '6,1', '24'], ['Яблочный сок', '0,5', '0,4', '9,7', '42'], ['Апельсиновый сок', '0,9', '0,1', '8,4', '36'], ['Вишневый сок', '0,5', '0', '10,6', '49'], ['Морковный сок', '1', '0,1', '6,5', '31'], ['Пиво безалкогольное', '0', '0', '4,1', '22'], ['Энергетический напиток', '0', '0', '11,4', '47']]
//     // l = [['Хлеб пшеничный', '7,4', '2,2', '53', '246'], ['Хлеб ржаной', '4,7', '0,6', '49,5', '210'], ['Сухари пшеничные', '11,6', '1,8', '72,1', '327'], ['Лаваш армянский', '7,7', '1,1', '47,8', '239'], ['Батон нарезной', '9,4', '2,7', '50,7', '261'], ['Баранки', '16,4', '1,1', '69,7', '342'], ['Сушки', '11,1', '1', '72,2', '335'], ['Булочка', '7,4', '1,8', '43,7', '218']]
//     // l = [['Куриное яйцо', '12,7', '11,1', '0,6', '153'], ['Перепелиное яйцо', '11,9', '13,3', '0,8', '170'], ['Утиное яйцо', '13,5', '14,1', '0,2', '176'], ['Омлет', '9,7', '15,5', '1,7']]
//     // l = [['Молоко 0%', '2,8', '0', '4,6', '34'], ['Молоко 1%', '2,8', '1', '4,6', '43'], ['Молоко 2,5%', '2,8', '2,5', '4,6', '53'], ['Молоко 3,2%', '2,8', '3,2', '4,6', '58'], ['Молоко сухое цельное', '25,2', '25', '39,6', '477'], ['Молоко сгущенное', '7,3', '7,7', '9,7', '139'], ['Кефир 0%', '2,8', '0', '3,8', '29'], ['Кефир 1%', '2,8', '1', '4', '37'], ['Кефир 2,5%', '3', '2,5', '4', '51'], ['Кефир 3,2%', '3,2', '3,2', '4,1', '57'], ['Сметана 10%', '3', '10', '2,9', '118'], ['Сметана 15%', '3', '15', '2,9', '163'], ['Сметана 20%', '3', '20', '2,9', '208'], ['Творог жирный', '14', '18', '1,9', '236'], ['Творог нежирный', '18,2', '0,6', '1,8', '89'], ['Творог полужирный', '16,5', '9', '1,9', '156'], ['Ряженка 2,5%', '2,9', '2,5', '4,1', '53'], ['Ряженка 4,0%', '2,9', '4', '4,1', '68'], ['Йогурт 1,5%', '4,3', '1,5', '8,4', '65'], ['Йогурт 3,2%', '5', '3,2', '8,9', '87'], ['Сливки 10%', '2,8', '10', '4,1', '121'], ['Сливки 20%', '2,8', '20', '3,9', '209'], ['Сыр сулугуни', '20', '24,2', '0', '293'], ['Сыр российский', '24,1', '29,8', '0,4', '366']]
//     // l = [['Бананы', '1,7', '0', '22,1', '87'], ['Апельсины', '0,8', '0', '8,6', '38'], ['Яблоки', '0,5', '0', '11,4', '48'], ['Груша', '0,5', '0', '10,6', '41'], ['Персики', '0,9', '0', '10,1', '42'], ['Абрикосы', '0,7', '0', '10,1', '44'], ['Ананас', '0,3', '0', '11,9', '49'], ['Киви', '1', '0,7', '9,7', '46'], ['Лимон', '0,9', '0', '3,3', '30'], ['Хурма', '0,7', '0', '15,7', '61'], ['Мандарин', '0,9', '0', '8,8']]
//     // l = [['Огурцы', '0,7', '0', '3,1', '15'], ['Томаты', '0,7', '0', '4,1', '19'], ['Картофель вареный', '2', '0,3', '16,5', '80'], ['Картофель молодой', '2,2', '0,3', '12,5', '57'], ['Морковь', '1,3', '0,1', '6,3', '29'], ['Лук репчатый', '1,6', '0', '9,3', '41'], ['Редис', '1,5', '0', '4,2', '22'], ['Кабачки', '0,8', '0,3', '5,9', '30'], ['Баклажаны', '0,6', '0,1', '7,5', '22'], ['Свекла', '1,7', '0', '10,5', '46'], ['Капуста белокочанная', '1,9', '0', '5,7', '31'], ['Фасоль', '4,4', '0', '4,4', '36'], ['Редька', '1,7', '0', '7,1', '33'], ['Перец сладкий', '1,2', '0', '5']]
//     for (let i = 0; i < l.length; i++) {
//         food.run(
//             'INSERT INTO veg(name, proteins, fats, carbohydrates, calories) VALUES(?, ?, ?, ?, ?)', l[i],
//             (err) => { if (err) console.log(err.message) }
//         )
//     }
// }, 1000);

// setTimeout(() => {
//     food.all('SELECT * FROM veg', (err, rows) => {
//         if (err) console.log(err.message)
//         else console.log(rows)
//     })
// }, 2000);